[
  {
    "date": "Previous Work",
    "heading": "No Proper Documentation for Previous Work",
    "show": true,
    "content": "We didn't have any proper documentation before this point, so writing down everything which already has been done. The idea was clear. We wanted to build a 6-wheel rover, which would be equipped with various sensors and would be able to find the shortest route given a destination. We had the model ready, (shown in the attached image). Now we are divided into two groups: One group will build the rover and the other will train it on simulation.",
    "image": "updates/prev_work.jpg"
  },
  {
    "date": "22nd January, 2023",
    "heading": "Cutting Rods and Starting to Build the Structure",
    "show": true,
    "content": "Given the 3-D structure of the rover, we started taking measurements of the aluminium rods we have and calculating the appropriate sizes for the least wastage. After marking the rods we took out the metal cutter and cut the rods. The new club members were taught how to use the metal cutter. All safety precautions were followed including safety goggles and gloves.",
    "image": ""
  },
  {
    "date": "29th January, 2023",
    "heading": "Joining the Rods to Build the Structure",
    "show": true,
    "content": "A discussion on how to join the metals took place. Due to the unavailability of any kind of welding equipment we had to use nuts and bolts, compromising the strength of the structure. The bolts we planned to use won't be enough so we put in a purchase request. The goal for the next session - complete the basic structure of the rover.",
    "image": ""
  },
  {
    "date": "24th February, 2023",
    "heading": "Progress on Completing the Body and Software Team Integrating Carla Simulation Engine",
    "show": true,
    "content": "During our recent lab session, we focused on building our rover and made significant progress. We completed the cuboid-shaped body of the rover and worked on joining the legs in 135-degree joints without using any 3D printed parts. We explored the use of 5mm acrylic sheets to create the joints, but concerns about the strength of the joints led us to consider other options such as aluminium. We plan to use a powerful metal-cutting CNC machine when it becomes available in the workshop.<br> &emsp; We also identified that the height of the frame was too tall and plan to reduce it in the next session. The software team was given access to a powerful computer and tasked with using the Carla simulation engine to import the Solidworks assembly of the rover as a car. Their goal is to write code that allows the rover to move using keys on the keyboard.",
    "image": ""
  }
]
